import Test001.File_UI;

import java.awt.*;

public class Start {
//===================================================================================================================================
// ===================================================================================================================================
//===================================================================================================================================
//主函数！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！程序的入口处
//开始的地方
    public static void main(String[] args) {
        EventQueue.invokeLater(new Runnable(){
            @Override
            public void run(){
                try {
                    File_UI window = new File_UI();//new一个可视化窗体出来
                    window.frame.setVisible(true);
                } catch (Exception e) {
                    e.printStackTrace();
                }
            }
        });
    }
}
