# Title     : TODO
# Objective : TODO
# Created by: Lambert
# Created on: 2020/12/2
print("Hello, World!")
age<-c(1,3,5,2,11,9,3,9,12,3) #使用组合函数c()创建向量age
 weight<-c(4.4,5.3,7.2,5.2,8.5,7.3,6.0,10.4,10.2,6.1)  #使用组合函数c()创建体重向量weight
 mean(weight) #调用mean求平均值的函数，求体重的平均值
##[1] 7.06
 sd(weight)      #调用sd()求标准差的函数，得到体重的标准差
##[1] 2.077498
 cor(age, weight)  #调用cor()函数，得到月龄与体重的相关度
##[1] 0.9075655
 plot(age, weight) #使用plot()函数，用图形展示月龄和体重的关系
###============================================================================================================###
###============================================================================================================###
###============================================================================================================###

a <- 1:10
save(a, file="./data.Rdata")
rm(a)
load("./data.Rdata")
print(a)
